scenarii/randomdate.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<!--

Author :  Rodolphe Quiedeville <rodolphe@quiedeville.org>

Random date demo

-->
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" weight="2" maxusers="100" />
  </clients>
  
  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="8080" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users interarrival="1" unit="second"></users>
    </arrivalphase>
  </load>

  <sessions>
    <session name='hello' probability='100' type='ts_http'>      

     <setdynvars sourcetype="erlang" callback="randomdate:get_date">
       <var name="date" />
     </setdynvars>

      <request subst="true">   
	<http url='/?%%_date%%' version='1.1' method='GET'></http>
      </request>
    </session>    
  </sessions>
</tsung>